#include <iostream>
/*
* for - предусловие
* while - предусловие
* do-while - следусловие
* 
* break, continue, goto
* 
* break - determine the loop
* continue - pass through the next iteration
* 
*/
int main()
{
	// 1. Напишете програма, която
	// извежда всички нечетни числа, кратни на 7
	// в интервала [a;b]. (Използвайте continue)
	int a, b;
	std::cin >> a;
	std::cin >> b;
	for (int i = a; i <= b; i++)
	{
		if (i % 2 == 0 || i % 7 != 0)
		{
			continue;
		}
		std::cout << i << " ";
	}
	/*
	* [1;20] -> 7
	*/
	// 2. Напишете програма, която 
	// по въведени температури за всеки ден от 
	// 1 седмица, извежда средно аритметичната 
	// температура и извежда колко градуса е било в 
	// четвъртък (използвайте continue)
	// вход: 20,12,18,29,30,12,8
	// изход: 18, 29

	//3. Напишете програма, която след въвеждане на числа
	// числа, до въвеждане на число   
	//  което е по-малко от 100,
	//  кратно на 5,
	//  двуцифрено 
	//  и нечетно 
	// след въвеждане на такова число, да се намери сумата
	// от цифрите на числото ( използвайте break)

	//4. Да се напише програма, колко 
	// цифри има дадено число
	
	//5. Да се напише програма, която извежда
	//броя на повторенията на една цифра, 
	//която се въвежда в конзолата,в дадено число
	//вход: 233424,3 изход: 2

	//6. Да се напише програма, когато извежда максималното,
	// минималното и средно аритметичното в една редица от 
	// числа (с дължина n)
}


